name: "fpenet_ensemble"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "raw_image_data"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  },
  {
    name: "true_boxes"
    data_type: TYPE_INT32
    dims: [ 4 ]
  }
]

output [
    {
      name: "conv_keypoints_m80"
      data_type: TYPE_FP32
      dims: [ -1, -1, -1 ]
    },
    {
      name: "softargmax"
      data_type: TYPE_FP32
      dims: [ -1, 2 ]
    },
    {
      name: "softargmax:1"
      data_type: TYPE_FP32
      dims: [ -1 ]
    }
  
  ]

ensemble_scheduling {
  step [
    {
      model_name: "fpenet_preprocess"
      model_version: 1
      input_map {
        key: "raw_image_data"
        value: "raw_image_data"
      }
      input_map {
        key: "true_boxes"
        value: "true_boxes"
      }
      output_map {
        key: "input_face_images"
        value: "input_face_images"
      }
    },
    {
      model_name: "fpenet"
      model_version: 1
      input_map {
        key: "input_face_images"
        value: "input_face_images"
      }
      output_map {
        key: "conv_keypoints_m80"
        value: "conv_keypoints_m80"
      }
      output_map {
        key: "softargmax"
        value: "softargmax"
      }
      output_map {
        key: "softargmax:1"
        value: "softargmax:1"
      }
    }
  ]
}